IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_BCDMA_0_BCDMA_BCHAN.xml
<module name="DMASS0_BCDMA_0_BCDMA_BCHAN" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="BCDMA_BCHAN_CFG" acronym="BCDMA_BCHAN_CFG" offset="0x0" width="32" description="The Channel Configuration Register is used to initialize static mode settings for the Block Copy DMA channel.  This register may only be written when the channel is disabled (tx_enable in realtime control reg is 0).">
		<bitfield id="PAUSE_ON_ERR" width="1" begin="31" end="31" resetval="0x0" description="Pause On Error:  this field controls what the channel will do if an error or exception occurs during a data transfer.  This field is encoded as follows: 0 = Channel will drop current work and move on 1 = Channel will pause and wait for SW to investigate and un-pause the channel." range="31" rwaccess="R/W"/> 
		<bitfield id="CHAN_TYPE" width="4" begin="19" end="16" resetval="0x12" description="Channel Type:  this field controls and / or indicates the functional channel type for this channel and the work passing mechanism that the channel uses for communicating with the Host.  Available channel types are as follows: 0-11 = RESERVED 12 = Channel performs Third Party Block Copy DMA transfers from memory to memory using pass by reference rings. 13-15 = RESERVED" range="19 - 16" rwaccess="R/NA"/> 
		<bitfield id="BURST_SIZE" width="2" begin="11" end="10" resetval="0x1" description="Specifies the nominal burst size and alignment for data transfers on this channel.  0 = 32 Bytes 1 = 64 Bytes All other values are reserved The optimal burst size setting is 64 Bytes to maximize utilization of the channel FIFOs." range="11 - 10" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_BCHAN_PRI_CTRL" acronym="BCDMA_BCHAN_PRI_CTRL" offset="0x64" width="32" description="The priority control register is used to control the priority of the transactions which the DMA generates on it's master interface.">
		<bitfield id="PRIORITY" width="3" begin="30" end="28" resetval="0x0" description="Priority: This field contains the 3-bit value which will be output on the mem*_cpriority and mem_cepriority outputs during all transactions for this channel." range="30 - 28" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="3" end="0" resetval="0x0" description="Order ID: This field contains the 4-bit value which will be output on the mem*_corderid output during all transactions for this channel." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_BCHAN_ST_SCHED" acronym="BCDMA_BCHAN_ST_SCHED" offset="0x80" width="32" description="The Channel N Static Scheduler Configuration Register contains static configuration information which affects the conditions under which each channel will be given an opportunity to use the Tx DMA unit(s).  The fields in this register are as follows:">
		<bitfield id="PRIORITY" width="2" begin="1" end="0" resetval="0x0" description="Scheduling Priority:  These bits select which scheduling bin the channel will be placed in for bandwidth allocation of the Tx/Rx DMA units.  This field is encoded as follows: 0 = High priority 1 = Medium - high priority 2 = Medium - low priority 3 = Low priority Arbitration between bins is performed in a strict priority fashion.   High priority channels will always be serviced first.  If no high priority channels are requesting then all medium-high priority channels will be serviced next.  If no high priority or medium-high priority channels are requesting then all medium-low priority channels will be serviced next.  When no other channels are requesting, the low priority channels will be serviced.  All channels within a given bin are serviced in a round robin order.  Only channels which are enabled and which have sufficient free space in their Per Channel FIFO will be included in the round robin arbitration." range="1 - 0" rwaccess="R/W"/>
	</register>
</module>